bibidentuhanoi/P4autoBoat/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_VL53L5CX_NB_TARGET_PER_ZONE=4
# --- ToF: transfer only the fields this architecture actually uses ---
# ARCHITECTURE DECISION (Kiet, 2026-08-08): ML trains on CAMERA IMAGES ONLY
# (PicoDet). ToF is NOT a training input -- it is a RUNTIME distance
# reference: detect an obstacle in the image, read the ToF distance to that
# obstacle to decide avoid-or-not, and measure zone distances to plan the
# route. So ToF only needs distance + enough confidence/validity to trust it.
#
# Disabling a field means the host never pulls it off the sensor at all
# (host-side read-length ONLY -- the sensor's ranging is computed identically
# regardless; verified in vl53l5cx_get_ranging_data()). Every enabled field
# is I2C bus-time task_tof_reader holds away from task_imu_fusion on the
# SHARED bus -- the whole reason heading/pitch/roll froze (fusion starved
# ~92-96% of ticks at the old all-fields ~3370B/read; ~1420B now, confirmed
# snappy). See sensor_fusion.c "fusion 5s: mutex_fails=".
#
# KEPT (what avoid/route decisions need): distance_mm, range_sigma_mm,
#   target_status, nb_target_detected -- all read by sensor_task/dashboard.
# DISABLED -- not used by the image-only-ML + ToF-as-distance-ref design.
#   The two marked "DATASET?" MIGHT be worth capturing IF a future plan ever
#   trains ML on ToF features -- but that is explicitly NOT the current
#   architecture. They are unrecoverable after collection, so flip the
#   relevant one back BEFORE any ToF-logging field campaign if that changes:
#   signal_per_spad     1028B  raw unnormalized signal (biggest single cost)
#   reflectance_percent  260B  DATASET? per-zone material/surface estimate --
#                              would matter only for ToF-feature ML, not this
#                              image-only design
#   ambient_per_spad     260B  DATASET? background-IR; could let a future set
#                              tell "clear" from "sun-blinded". sigma+status
#                              already carry runtime confidence, so not now
#   nb_spads_enabled     260B  internal photodiode bookkeeping, no use
#   motion_indicator     144B  motion detection -- confirmed not needed
CONFIG_VL53L5CX_DISABLE_AMBIENT_PER_SPAD=y
CONFIG_VL53L5CX_DISABLE_NB_SPADS_ENABLED=y
CONFIG_VL53L5CX_DISABLE_SIGNAL_PER_SPAD=y
CONFIG_VL53L5CX_DISABLE_REFLECTANCE_PERCENT=y
CONFIG_VL53L5CX_DISABLE_MOTION_INDICATOR=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=2000
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X640_50FPS=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# --- esp_hosted slave: ESP32-C6 over SDIO ---
# Seed BOTH the legacy and current choice-symbol names: kconfgen regens have
# been observed collapsing the slave-target choice to ESP32-H2 (a no-WiFi
# chip), which silently erases every WIFI_RMT_*/SDIO symbol from sdkconfig.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# --- LWIP tuning for stability over ESP-Hosted ---
# PSRAM fallback (SPIRAM_TRY_ALLOCATE_WIFI_LWIP) lets us use larger buffers
# without exhausting internal SRAM.  16KB absorbs ToF frame bursts (3-5KB
# at 20Hz) and avoids EAGAIN from buffer-full on flaky esp_hosted WiFi.
# Tested stable — no heap issues with 7 sockets × 16KB + PSRAM fallback.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_LWIP_TCP_MSL=6000
CONFIG_LWIP_TCP_OVERSIZE_MSS=y

# --- Let lwip fall back to PSRAM when internal SRAM is tight ---
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Protect internal RAM for DMA/internal-only allocations ---
# esp_hosted's SDIO RX buffers are MALLOC_CAP_INTERNAL-only and its pool grows
# on demand; under an RX burst with internal RAM tight the alloc returned NULL
# and sdio_drv.c:928 assert-rebooted the boat (seen on hardware while
# streaming). 64KB reserve makes generic mallocs spill to PSRAM sooner.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# --- Heap poisoning (light) — catches corruption early, ~2% overhead ---
CONFIG_HEAP_POISONING_LIGHT=y

# --- Disable WiFi power save for lower latency / fewer drops ---
# (CONFIG_ESP_WIFI_PS_NONE is a dead symbol on esp_hosted — kconfgen warned
#  "unknown symbol" every regen. PS_NONE is applied at runtime instead via
#  esp_wifi_set_ps() in wifi_manager.c.)

# --- ESP-NOW field mode ---
CONFIG_ESPNOW_ENABLED=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=8
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
